nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/motion_control_servo_rt1180_cm7/board/pin_mux.h
/*
* Copyright 2024 NXP
*
* SPDX-License-Identifier: BSD-3-Clause
*/
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_EMC_B1_06 (coord K3), USER_LED0 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_LED0_PERIPHERAL                               RGPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_USER_LED0_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_LED0_CHANNEL                                      6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_LED0_GPIO                                     RGPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_LED0_GPIO_PIN                                     6U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_LED0_GPIO_PIN_MASK                        (1U << 6U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_07 (coord M3), USER_LED1 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_LED1_PERIPHERAL                               RGPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_USER_LED1_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_LED1_CHANNEL                                      7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_LED1_GPIO                                     RGPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_LED1_GPIO_PIN                                     7U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_LED1_GPIO_PIN_MASK                        (1U << 7U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_09 (coord E1), USER_LED3 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_LED3_PERIPHERAL                               RGPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_USER_LED3_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_LED3_CHANNEL                                      9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_LED3_GPIO                                     RGPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_LED3_GPIO_PIN                                     9U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_LED3_GPIO_PIN_MASK                        (1U << 9U)   /*!< GPIO pin mask */

/* GPIO_B2_00 (coord E9), TP150 */
/* Routed pin properties */
#define BOARD_INITPINS_TP150_PERIPHERAL                                   RGPIO6   /*!< Peripheral name */
#define BOARD_INITPINS_TP150_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TP150_CHANNEL                                         14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TP150_GPIO                                         RGPIO6   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TP150_GPIO_PIN                                        14U   /*!< GPIO pin number */
#define BOARD_INITPINS_TP150_GPIO_PIN_MASK                           (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_B2_01 (coord E10), TP151 */
/* Routed pin properties */
#define BOARD_INITPINS_TP151_PERIPHERAL                                   RGPIO6   /*!< Peripheral name */
#define BOARD_INITPINS_TP151_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TP151_CHANNEL                                         15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TP151_GPIO                                         RGPIO6   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TP151_GPIO_PIN                                        15U   /*!< GPIO pin number */
#define BOARD_INITPINS_TP151_GPIO_PIN_MASK                           (1U << 15U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

/* GPIO_AD_14 (coord N14), M1_IA */
/* Routed pin properties */
#define BOARD_INITADC_M1_IA_PERIPHERAL                                      ADC1   /*!< Peripheral name */
#define BOARD_INITADC_M1_IA_SIGNAL                                             A   /*!< Signal name */
#define BOARD_INITADC_M1_IA_CHANNEL                                           1U   /*!< Signal channel */

/* GPIO_AD_15 (coord N16), M1_IB */
/* Routed pin properties */
#define BOARD_INITADC_M1_IB_PERIPHERAL                                      ADC1   /*!< Peripheral name */
#define BOARD_INITADC_M1_IB_SIGNAL                                             B   /*!< Signal name */
#define BOARD_INITADC_M1_IB_CHANNEL                                           1U   /*!< Signal channel */

/* GPIO_AD_12 (coord P17), TP119 */
/* Routed pin properties */
#define BOARD_INITADC_M2_IA_PERIPHERAL                                      ADC1   /*!< Peripheral name */
#define BOARD_INITADC_M2_IA_SIGNAL                                             A   /*!< Signal name */
#define BOARD_INITADC_M2_IA_CHANNEL                                           1U   /*!< Signal channel */

/* GPIO_AD_13 (coord N15), M2_IB */
/* Routed pin properties */
#define BOARD_INITADC_M2_IB_PERIPHERAL                                      ADC1   /*!< Peripheral name */
#define BOARD_INITADC_M2_IB_SIGNAL                                             B   /*!< Signal name */
#define BOARD_INITADC_M2_IB_CHANNEL                                           1U   /*!< Signal channel */

/* GPIO_AD_18 (coord K16), M1_IC */
/* Routed pin properties */
#define BOARD_INITADC_M1_IC_PERIPHERAL                                      ADC2   /*!< Peripheral name */
#define BOARD_INITADC_M1_IC_SIGNAL                                             A   /*!< Signal name */
#define BOARD_INITADC_M1_IC_CHANNEL                                           2U   /*!< Signal channel */

