nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/motion_control_servo_rt1180_cm7/board/pin_mux.h
/* GPIO_AD_19 (coord L13), M1_UDC */
/* Routed pin properties */
#define BOARD_INITADC_M1_UDC_PERIPHERAL                                     ADC2   /*!< Peripheral name */
#define BOARD_INITADC_M1_UDC_SIGNAL                                            B   /*!< Signal name */
#define BOARD_INITADC_M1_UDC_CHANNEL                                          2U   /*!< Signal channel */

/* GPIO_AD_22 (coord K12), M1_IDC */
/* Routed pin properties */
#define BOARD_INITADC_M1_IDC_PERIPHERAL                                     ADC2   /*!< Peripheral name */
#define BOARD_INITADC_M1_IDC_SIGNAL                                            A   /*!< Signal name */
#define BOARD_INITADC_M1_IDC_CHANNEL                                          2U   /*!< Signal channel */

/* GPIO_AD_20 (coord K13), M2_IC */
/* Routed pin properties */
#define BOARD_INITADC_M2_IC_PERIPHERAL                                      ADC2   /*!< Peripheral name */
#define BOARD_INITADC_M2_IC_SIGNAL                                             A   /*!< Signal name */
#define BOARD_INITADC_M2_IC_CHANNEL                                           2U   /*!< Signal channel */

/* GPIO_AD_21 (coord K15), M2_UDC */
/* Routed pin properties */
#define BOARD_INITADC_M2_UDC_PERIPHERAL                                     ADC2   /*!< Peripheral name */
#define BOARD_INITADC_M2_UDC_SIGNAL                                            B   /*!< Signal name */
#define BOARD_INITADC_M2_UDC_CHANNEL                                          2U   /*!< Signal channel */

/* GPIO_AD_23 (coord K14), M2_IDC */
/* Routed pin properties */
#define BOARD_INITADC_M2_IDC_PERIPHERAL                                     ADC2   /*!< Peripheral name */
#define BOARD_INITADC_M2_IDC_SIGNAL                                            B   /*!< Signal name */
#define BOARD_INITADC_M2_IDC_CHANNEL                                          2U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC(void);                     /* Function assigned for the Cortex-M7F */

#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_10_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT10 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_4_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT4 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_5_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT5 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_8_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT8 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_9_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT9 function direction select: XBAR_INOUT as input */

/* GPIO_EMC_B1_12 (coord G6), M1_PWM_A0 */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_A0_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_A0_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_A0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_13 (coord F3), M1_PWM_B0 */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_B0_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_B0_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_B0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_14 (coord G5), M1_PWM_A1 */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_A1_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_A1_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_A1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_15 (coord G2), M1_PWM_B1 */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_B1_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_B1_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_B1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_17 (coord E2), M1_PWM_A2 */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_A2_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_A2_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_A2_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_B1_16 (coord H1), M1_PWM_B2 */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_B2_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_B2_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_B2_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_B1_18 (coord D1), M2_PWM_A0 */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_A0_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_A0_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_A0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_19 (coord F4), M2_PWM_B0 */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_B0_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_B0_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_B0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_20 (coord G1), M2_PWM_A1 */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_A1_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_A1_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_A1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_21 (coord K4), M2_PWM_B1 */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_B1_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_B1_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_B1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_23 (coord F1), M2_PWM_A2 */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_A2_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_A2_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_A2_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_B1_22 (coord L3), M2_PWM_B2 */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_B2_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_B2_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_B2_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_B1_00 (coord H3), M1_FAULT_OV */
/* Routed pin properties */
#define BOARD_INITPWM_M1_FAULT_OV_PERIPHERAL                                PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_FAULT_OV_SIGNAL                                   FAULT   /*!< Signal name */
#define BOARD_INITPWM_M1_FAULT_OV_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_EMC_B1_01 (coord H4), M1_FAULT_OC */
/* Routed pin properties */
#define BOARD_INITPWM_M1_FAULT_OC_PERIPHERAL                                PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_FAULT_OC_SIGNAL                                   FAULT   /*!< Signal name */
#define BOARD_INITPWM_M1_FAULT_OC_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_EMC_B1_26 (coord N4), M1_FAULT_OT */
/* Routed pin properties */
#define BOARD_INITPWM_M1_FAULT_OT_PERIPHERAL                                PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_FAULT_OT_SIGNAL                                   FAULT   /*!< Signal name */
#define BOARD_INITPWM_M1_FAULT_OT_CHANNEL                                     2U   /*!< Signal channel */

