nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/motion_control_servo_rt1180_cm7/board/pin_mux.h
/* GPIO_EMC_B1_04 (coord J4), M2_FAULT_OV */
/* Routed pin properties */
#define BOARD_INITPWM_M2_FAULT_OV_PERIPHERAL                                PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_FAULT_OV_SIGNAL                                   FAULT   /*!< Signal name */
#define BOARD_INITPWM_M2_FAULT_OV_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_EMC_B1_05 (coord H6), M2_FAULT_OC */
/* Routed pin properties */
#define BOARD_INITPWM_M2_FAULT_OC_PERIPHERAL                                PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_FAULT_OC_SIGNAL                                   FAULT   /*!< Signal name */
#define BOARD_INITPWM_M2_FAULT_OC_CHANNEL                                     1U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM(void);                     /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPUART(void);                  /* Function assigned for the Cortex-M7F */

#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_12_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT12 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_13_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT13 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_20_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT20 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_21_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT21 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_22_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT22 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_23_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT23 function direction select: XBAR_INOUT as input */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENC(void);                     /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCMP(void);                     /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B1_04 (coord B15), M1_GD3000_RESET */
/* Routed pin properties */
#define BOARD_INITLPSPI3_M1_GD3000_RESET_PERIPHERAL                       RGPIO5   /*!< Peripheral name */
#define BOARD_INITLPSPI3_M1_GD3000_RESET_SIGNAL                          gpio_io   /*!< Signal name */
#define BOARD_INITLPSPI3_M1_GD3000_RESET_CHANNEL                              8U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLPSPI3_M1_GD3000_RESET_GPIO                             RGPIO5   /*!< GPIO peripheral base pointer */
#define BOARD_INITLPSPI3_M1_GD3000_RESET_GPIO_PIN                             8U   /*!< GPIO pin number */
#define BOARD_INITLPSPI3_M1_GD3000_RESET_GPIO_PIN_MASK                (1U << 8U)   /*!< GPIO pin mask */

/* GPIO_SD_B1_05 (coord A16), M1_GD3000_EN */
/* Routed pin properties */
#define BOARD_INITLPSPI3_M1_GD3000_EN_PERIPHERAL                          RGPIO5   /*!< Peripheral name */
#define BOARD_INITLPSPI3_M1_GD3000_EN_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITLPSPI3_M1_GD3000_EN_CHANNEL                                 9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLPSPI3_M1_GD3000_EN_GPIO                                RGPIO5   /*!< GPIO peripheral base pointer */
#define BOARD_INITLPSPI3_M1_GD3000_EN_GPIO_PIN                                9U   /*!< GPIO pin number */
#define BOARD_INITLPSPI3_M1_GD3000_EN_GPIO_PIN_MASK                   (1U << 9U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPSPI3(void);                  /* Function assigned for the Cortex-M7F */

/* GPIO_AON_19 (coord D5), M2_GD3000_RESET */
/* Routed pin properties */
#define BOARD_INITLPSPI2_M2_GD3000_RESET_PERIPHERAL                       RGPIO1   /*!< Peripheral name */
#define BOARD_INITLPSPI2_M2_GD3000_RESET_SIGNAL                          gpio_io   /*!< Signal name */
#define BOARD_INITLPSPI2_M2_GD3000_RESET_CHANNEL                             19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLPSPI2_M2_GD3000_RESET_GPIO                             RGPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITLPSPI2_M2_GD3000_RESET_GPIO_PIN                            19U   /*!< GPIO pin number */
#define BOARD_INITLPSPI2_M2_GD3000_RESET_GPIO_PIN_MASK               (1U << 19U)   /*!< GPIO pin mask */

/* GPIO_AON_20 (coord E5), M2_GD3000_EN */
/* Routed pin properties */
#define BOARD_INITLPSPI2_M2_GD3000_EN_PERIPHERAL                          RGPIO1   /*!< Peripheral name */
#define BOARD_INITLPSPI2_M2_GD3000_EN_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITLPSPI2_M2_GD3000_EN_CHANNEL                                20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLPSPI2_M2_GD3000_EN_GPIO                                RGPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITLPSPI2_M2_GD3000_EN_GPIO_PIN                               20U   /*!< GPIO pin number */
#define BOARD_INITLPSPI2_M2_GD3000_EN_GPIO_PIN_MASK                  (1U << 20U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPSPI2(void);                  /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SINC_Motor1(void);                       /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SINC_Motor2(void);                       /* Function assigned for the Cortex-M7F */

