nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/motion_control_servo_rt1180_cm7/board/pin_mux.h
/* GPIO_EMC_B1_10 (coord E3), M1_485 */
/* Routed pin properties */
#define BOARD_UART5_M1_485_PERIPHERAL                                     RGPIO2   /*!< Peripheral name */
#define BOARD_UART5_M1_485_SIGNAL                                        gpio_io   /*!< Signal name */
#define BOARD_UART5_M1_485_CHANNEL                                           10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_UART5_M1_485_GPIO                                           RGPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_UART5_M1_485_GPIO_PIN                                          10U   /*!< GPIO pin number */
#define BOARD_UART5_M1_485_GPIO_PIN_MASK                             (1U << 10U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UART5(void);                       /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_11 (coord F2), M2_485 */
/* Routed pin properties */
#define BOARD_UART8_M2_485_PERIPHERAL                                     RGPIO2   /*!< Peripheral name */
#define BOARD_UART8_M2_485_SIGNAL                                        gpio_io   /*!< Signal name */
#define BOARD_UART8_M2_485_CHANNEL                                           11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_UART8_M2_485_GPIO                                           RGPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_UART8_M2_485_GPIO_PIN                                          11U   /*!< GPIO pin number */
#define BOARD_UART8_M2_485_GPIO_PIN_MASK                             (1U << 11U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UART8(void);                       /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void M7_DebugConsole(void);                   /* Function assigned for the Cortex-M7F */

#define QTIMER_CTRL1_QTIMER1_TMR0_INPUT_SEL_XBAR 0x01U /*!< QTIMER1 TMR0 input select: Input from XBAR */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SLOWLOOP_TRIGGER(void);                  /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
